Catalogs/ПравилаОбменаСПодключаемымОборудованиемOffline.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПравилаОбменаСПодключаемымОборудованиемOffline</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПодключаемогоОборудования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПодключаемогоОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьГруппыТоваров</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦеныНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДДСПриПродаже</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДДСПриВозврате</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДоходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/КодыТоваровPLUНаОборудовании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КодыТоваровPLUНаОборудовании</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КодТовараSKU</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПравилоОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаОбменаСПодключаемымОборудованиемOffline</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодТовараPLU</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КодыТоваровSKU.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КодыТоваровSKU</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>SKU</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыПодключаемогоОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыПодключаемогоОборудования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СканерШтрихкода</Name>
					<Comment>Scanner</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательМагнитныхКарт</Name>
					<Comment>MSR</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ККТ</Name>
					<Comment>KKT</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФискальныйРегистратор</Name>
					<Comment>FiscalPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринтерЧеков</Name>
					<Comment>ReceiptPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДисплейПокупателя</Name>
					<Comment>LineDisplay</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТерминалСбораДанных</Name>
					<Comment>DataCollectionTerminal</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭквайринговыйТерминал</Name>
					<Comment>AcquiringTerminal</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронныеВесы</Name>
					<Comment>Scale</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВесыСПечатьюЭтикеток</Name>
					<Comment>ScaleOffline</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ККМОфлайн</Name>
					<Comment>ECROffline</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринтерЭтикеток</Name>
					<Comment>LabelPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательRFID</Name>
					<Comment>RFID</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьWebСервисОборудование</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПравилаОбменаСПодключаемымОборудованиемOffline/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	// Коды товаров
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "КодыТоваров";
	КомандаПечати.Представление = НСтр("ru = 'Коды товаров'");

КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "КодыТоваров") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"КодыТоваров",
			НСтр("ru = 'Коды товаров'"),
			СформироватьПечатнуюФормуКодыТоваров(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьПечатнуюФормуКодыТоваров(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_КодыТоваров";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.ПравилаОбменаСПодключаемымОборудованиемOffline.КодыТоваров");
	ПервыйДокумент = Истина;
	
	Для Каждого Объект Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ВыгрузкаНаВесы = Объект.ТипПодключаемогоОборудования = Перечисления.ТипыПодключаемогоОборудования.ВесыСПечатьюЭтикеток;
		
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		Если ВыгрузкаНаВесы Тогда
			ОбластьМакета.Параметры.ТекстЗаголовка = НСтр("ru = 'Коды товаров PLU для весов с печатью этикеток'");
		Иначе
			ОбластьМакета.Параметры.ТекстЗаголовка = НСтр("ru = 'Коды товаров SKU для кассы ККМ Offline'"); 
		КонецЕсли;
		ОбластьМакета.Параметры.ПравилоОбмена  = Объект;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьТовар = Макет.ПолучитьОбласть("ШапкаТаблицы|Товар");
		ОбластьКод   = Макет.ПолучитьОбласть("ШапкаТаблицы|Код");
		Если ВыгрузкаНаВесы Тогда
			ОбластьКод.Параметры.ЗаголовокКода = "PLU"; 
		Иначе
			ОбластьКод.Параметры.ЗаголовокКода = "SKU"; 
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьКод);
		ТабличныйДокумент.Присоединить(ОбластьТовар);
		
		ОбластьКод   = Макет.ПолучитьОбласть("Строка|Код");
		ОбластьТовар = Макет.ПолучитьОбласть("Строка|Товар");
		
		Товары = ПодключаемоеОборудованиеOfflineВызовСервера.ТоварыДляПравила(Объект);
		Для Каждого СтрокаТЧ Из Товары Цикл
			
			Если ВыгрузкаНаВесы И СтрокаТЧ.ЕстьОшибки Тогда
				Продолжить;
			КонецЕсли;
			
			ОбластьКод.Параметры.Код = СтрокаТЧ.PLU;
			ТабличныйДокумент.Вывести(ОбластьКод);
			ОбластьТовар.Параметры.Товар = СтрокаТЧ.Наименование;
			ТабличныйДокумент.Присоединить(ОбластьТовар);
			
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Итого");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Вывести подписи.
		ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
		ОбластьМакета.Параметры.Ответственный = Пользователи.ТекущийПользователь();
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Объект);
	
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает список товаров по правилу обмена.
//
// Параметры:
//  ПравилоОбмена - СправочникСсылка.ПравилоОбменаСПодключаемымОборудованием - правило обмена.
//
// Возвращаемое значение:
//  ТаблицаЗначений - список товаров по правилу обмена.
//
Функция СписокТоваровПоПравилу(ПравилоОбмена) Экспорт
	
	СтруктураРеквизитовПравила = Новый Структура;
	СтруктураРеквизитовПравила.Вставить("Склад", "Склад");
	СтруктураРеквизитовПравила.Вставить("Магазин", "Магазин");
	СтруктураРеквизитовПравила.Вставить("ВыгружатьГруппыТоваров", "ВыгружатьГруппыТоваров");
	СтруктураРеквизитовПравила.Вставить("НастройкиКомпоновкиДанных", "НастройкиКомпоновкиДанных");
	СтруктураРеквизитовПравила.Вставить("ТипПодключаемогоОборудования", "ТипПодключаемогоОборудования"); 
	СтруктураРеквизитовПравила.Вставить("ВидЦеныНоменклатуры", "ВидЦеныНоменклатуры");

	РеквизитыПравила = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПравилоОбмена, СтруктураРеквизитовПравила);
	Склад = РеквизитыПравила.Склад;
	Магазин = РеквизитыПравила.Магазин;
	ВидЦеныНоменклатуры = РеквизитыПравила.ВидЦеныНоменклатуры;
	
	СхемаКомпоновкиДанных = Справочники.ПравилаОбменаСПодключаемымОборудованиемOffline.ПолучитьМакет("ОбновлениеКодовSKU");
	
	// Подготовка компоновщика макета компоновки данных, загрузка настроек.
	Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных;
	Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	
	Компоновщик.ЗагрузитьНастройки(РеквизитыПравила.НастройкиКомпоновкиДанных.Получить());
	Компоновщик.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	
	// Заполнение структуры отчета и выбранных полей.
	Компоновщик.Настройки.Структура.Очистить();
	
	ГруппировкаДетальныеЗаписи = Компоновщик.Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	ГруппировкаДетальныеЗаписи.Использование = Истина;
	
	Компоновщик.Настройки.Выбор.Элементы.Очистить();
	
	ВыбранноеПоле               = ГруппировкаДетальныеЗаписи.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Поле          = Новый ПолеКомпоновкиДанных("Номенклатура");
	ВыбранноеПоле.Использование = Истина;
	
	ВыбранноеПоле               = ГруппировкаДетальныеЗаписи.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Поле          = Новый ПолеКомпоновкиДанных("Группа");
	ВыбранноеПоле.Использование = Истина;
	
	//Если ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристикиНоменклатуры") Тогда
		ВыбранноеПоле               = ГруппировкаДетальныеЗаписи.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПоле.Поле          = Новый ПолеКомпоновкиДанных("Характеристика");
		ВыбранноеПоле.Использование = Истина;
	//КонецЕсли;
	
	//Если ПолучитьФункциональнуюОпцию("ИспользоватьУпаковкиНоменклатуры") Тогда
		ВыбранноеПоле               = ГруппировкаДетальныеЗаписи.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПоле.Поле          = Новый ПолеКомпоновкиДанных("ЕдиницаИзмерения");
		ВыбранноеПоле.Использование = Истина;
	//КонецЕсли;
	
	ВыбранноеПоле               = ГруппировкаДетальныеЗаписи.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Поле          = Новый ПолеКомпоновкиДанных("SKU");
	ВыбранноеПоле.Использование = Истина;
	
	//ВыбранноеПоле               = ГруппировкаДетальныеЗаписи.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	//ВыбранноеПоле.Поле          = Новый ПолеКомпоновкиДанных("Весовой");
	//ВыбранноеПоле.Использование = Истина;
	
	ВыбранноеПоле               = ГруппировкаДетальныеЗаписи.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Поле          = Новый ПолеКомпоновкиДанных("ЭтоГруппа");
	ВыбранноеПоле.Использование = Истина;
	
	ВыбранноеПоле               = ГруппировкаДетальныеЗаписи.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Поле          = Новый ПолеКомпоновкиДанных("ВидНоменклатуры");
	ВыбранноеПоле.Использование = Истина;
	
	ВыбранноеПоле               = ГруппировкаДетальныеЗаписи.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Поле          = Новый ПолеКомпоновкиДанных("КоличествоОстаток");
	ВыбранноеПоле.Использование = Истина;
	
	ВыбранноеПоле               = ГруппировкаДетальныеЗаписи.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Поле          = Новый ПолеКомпоновкиДанных("Цена");
	ВыбранноеПоле.Использование = Истина;
		
	// Компоновка макета и исполнение запроса.
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	Попытка
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Компоновщик.ПолучитьНастройки(), , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	Исключение
		
		ТекстСообщения = НСтр("ru='В процессе формирования списка товаров произошла ошибка.
								|Правило обмена с подключаемым оборудованием %1 требует проверки.
								|%2'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ПравилоОбмена, ОписаниеОшибки());
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат Неопределено;
		
	КонецПопытки;
	
	Параметр = МакетКомпоновки.ЗначенияПараметров.Найти("Дата");
	Если Параметр <> Неопределено Тогда
		Параметр.Значение = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Параметр = МакетКомпоновки.ЗначенияПараметров.Найти("ПравилоОбмена");
	Если Параметр <> Неопределено Тогда
		Параметр.Значение = ПравилоОбмена;
	КонецЕсли;
	
	Параметр = МакетКомпоновки.ЗначенияПараметров.Найти("Склад");
	Если Параметр <> Неопределено Тогда
		Параметр.Значение = Склад;
	КонецЕсли;
	
	Параметр = МакетКомпоновки.ЗначенияПараметров.Найти("ВидЦены");
	Если Параметр <> Неопределено Тогда
		Если ЗначениеЗаполнено(ВидЦеныНоменклатуры) Тогда
			Параметр.Значение = ВидЦеныНоменклатуры;
		Иначе
			Параметр.Значение = Справочники.ВидыЦен.ОсновнаяЦенаПродажи();
		КонецЕсли;
	КонецЕсли;
	
	Параметр = МакетКомпоновки.ЗначенияПараметров.Найти("ТолькоСУстановленнымиЦенами");
	ТолькоСУстановленнымиЦенами = Ложь;
	
	Если Параметр <> Неопределено Тогда
		
		ТолькоСЦенами = Новый ПолеКомпоновкиДанных("ТолькоСУстановленнымиЦенами");
		
		СписокЭлементовОтбора = Компоновщик.Настройки.Отбор.Элементы;
		
		Для каждого Элемент Из СписокЭлементовОтбора Цикл
			
			Если ТипЗнч(Элемент) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
				Продолжить;
			КонецЕсли;
			
			Если Элемент.ЛевоеЗначение = ТолькоСЦенами И Элемент.Использование Тогда
				ТолькоСУстановленнымиЦенами = Элемент.ПравоеЗначение;
			КонецЕсли;
		КонецЦикла;
		
		Параметр.Значение = ТолькоСУстановленнымиЦенами;
		
	КонецЕсли;
	
	// ИспользоватьУпаковкиНоменклатуры
	//Параметр = МакетКомпоновки.ЗначенияПараметров.Найти("ИспользоватьУпаковкиНоменклатуры");
	//ИспользоватьУпаковкиНоменклатуры = ПолучитьФункциональнуюОпцию("ИспользоватьУпаковкиНоменклатуры");
	//
	//Если Параметр <> Неопределено Тогда
	//	
	//	ПолеКомпоновки = Новый ПолеКомпоновкиДанных("ИспользоватьУпаковкиНоменклатуры");
	//	
	//	СписокЭлементовОтбора = Компоновщик.Настройки.Отбор.Элементы;
	//	
	//	Для Каждого Элемент Из СписокЭлементовОтбора Цикл
	//		
	//		Если ТипЗнч(Элемент) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
	//			Продолжить;
	//		КонецЕсли;
	//		
	//		Если (Элемент.ЛевоеЗначение = ПолеКомпоновки) И Элемент.Использование Тогда
	//			ИспользоватьУпаковкиНоменклатуры = Элемент.ПравоеЗначение;
	//		КонецЕсли;
	//	КонецЦикла;
	//	
	//	Параметр.Значение = ИспользоватьУпаковкиНоменклатуры;
	//	
	//КонецЕсли;
	
	// ИспользоватьХарактеристикиНоменклатуры
	//Параметр = МакетКомпоновки.ЗначенияПараметров.Найти("ИспользоватьХарактеристикиНоменклатуры");
	//ИспользоватьХарактеристикиНоменклатуры = ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристикиНоменклатуры");
	//
	//Если Параметр <> Неопределено Тогда
	//	
	//	ПолеКомпоновки = Новый ПолеКомпоновкиДанных("ИспользоватьХарактеристикиНоменклатуры");
	//	
	//	СписокЭлементовОтбора = Компоновщик.Настройки.Отбор.Элементы;
	//	
	//	Для каждого Элемент Из СписокЭлементовОтбора Цикл
	//		
	//		Если ТипЗнч(Элемент) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
	//			Продолжить;
	//		КонецЕсли;
	//		
	//		Если (Элемент.ЛевоеЗначение = ПолеКомпоновки) И Элемент.Использование Тогда
	//			ИспользоватьХарактеристикиНоменклатуры = Элемент.ПравоеЗначение;
	//		КонецЕсли;
	//	КонецЦикла;
	//	
	//	Параметр.Значение = ИспользоватьХарактеристикиНоменклатуры;
	//	
	//КонецЕсли;
	
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ДанныеОтчета = Новый ТаблицаЗначений();
	ПроцессорВывода.УстановитьОбъект(ДанныеОтчета);
	ДанныеОтчета = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	//Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристикиНоменклатуры") Тогда
	//	ДанныеОтчета.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	//КонецЕсли;
	//
	//Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьУпаковкиНоменклатуры") Тогда
	//	ДанныеОтчета.Колонки.Добавить("Упаковка", Новый ОписаниеТипов("СправочникСсылка.УпаковкиНоменклатуры"));
	//КонецЕсли;
	
	Если РеквизитыПравила.ВыгружатьГруппыТоваров Тогда
		
		МассивНоменклатур = ДанныеОтчета.ВыгрузитьКолонку("Номенклатура");
		ДобавитьГруппыНоменклатуры(ДанныеОтчета, МассивНоменклатур);
		//ДанныеОтчета.Свернуть("SKU, Весовой, Группа, КоличествоОстаток, Номенклатура, ТипНоменклатуры, Упаковка, Характеристика, ЭтоГруппа, Цена, ДоговорКонтрагента");
		ДанныеОтчета.Свернуть("SKU, Группа, КоличествоОстаток, Номенклатура, ВидНоменклатуры, ЕдиницаИзмерения, Характеристика, ЭтоГруппа, Цена");
		
	КонецЕсли;
		
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Товары.Группа КАК Группа,
	|	Товары.ЭтоГруппа КАК ЭтоГруппа,
	|	Товары.SKU КАК SKU,
	//|	Товары.Весовой КАК Весовой,
	|	Товары.КоличествоОстаток КАК КоличествоОстаток,
	|	Товары.Цена КАК Цена
	|ПОМЕСТИТЬ ТаблицаДанныхСОтбором
	|ИЗ
	|	&Товары КАК Товары
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ТолькоСУстановленнымиЦенами
	|				ТОГДА НЕ(Товары.Цена = 0
	|							И НЕ Товары.ЭтоГруппа)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	SKU
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КодыТоваровPLUНаОборудовании.КодТовараSKU КАК КодТовараSKU,
	|	КодыТоваровPLUНаОборудовании.КодТовараPLU КАК КодТовараPLU
	|ПОМЕСТИТЬ ТаблицаКодыТоваров
	|ИЗ
	|	РегистрСведений.КодыТоваровPLUНаОборудовании КАК КодыТоваровPLUНаОборудовании
	|ГДЕ
	|	КодыТоваровPLUНаОборудовании.ПравилоОбмена = &ПравилоОбмена
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДанныхСОтбором.SKU КАК SKU,
	|	ТаблицаКодыТоваров.КодТовараPLU КАК PLU,
	|	ТаблицаДанныхСОтбором.Номенклатура КАК Номенклатура,
	|	ТаблицаДанныхСОтбором.Характеристика КАК Характеристика,
	|	ТаблицаДанныхСОтбором.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТаблицаДанныхСОтбором.Группа КАК Группа,
	|	ТаблицаДанныхСОтбором.ЭтоГруппа КАК ЭтоГруппа,
	|	ТаблицаДанныхСОтбором.Цена КАК Цена,
	//|	ТаблицаДанныхСОтбором.Весовой КАК Весовой,
	|	Ложь КАК Весовой,
	|	ТаблицаДанныхСОтбором.КоличествоОстаток КАК КоличествоОстаток,
	|	ВЫБОР
	|		КОГДА ТаблицаДанныхСОтбором.ЭтоГруппа
	|			ТОГДА 0
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК ИндексПиктограммы
	|ИЗ
	|	ТаблицаКодыТоваров КАК ТаблицаКодыТоваров
	|		ПОЛНОЕ СОЕДИНЕНИЕ ТаблицаДанныхСОтбором КАК ТаблицаДанныхСОтбором
	|		ПО ТаблицаКодыТоваров.КодТовараSKU = ТаблицаДанныхСОтбором.SKU
	|ГДЕ
	|	НЕ ТаблицаДанныхСОтбором.Номенклатура ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЭтоГруппа УБЫВ";
	
	//ВыгрузкаНаВесы = РеквизитыПравила.ТипПодключаемогоОборудования = Перечисления.ТипыПодключаемогоОборудования.ВесыСПечатьюЭтикеток;
	//
	//Если ВыгрузкаНаВесы Тогда
	//	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//Условия" ,"");
	//КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Товары", ДанныеОтчета);
	Запрос.УстановитьПараметр("ПравилоОбмена", ПравилоОбмена);
	Запрос.УстановитьПараметр("ТолькоСУстановленнымиЦенами", ТолькоСУстановленнымиЦенами);
	Результат = Запрос.Выполнить();
	
	СписокТоваров = Запрос.Выполнить().Выгрузить();
	
	Возврат СписокТоваров;
	
КонецФункции

Процедура ДобавитьГруппыНоменклатуры(Товары, МассивНоменклатур)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СпрНоменклатура.Родитель КАК Номенклатура,
	|	МАКСИМУМ(КодыТоваровSKU.SKU) КАК SKU,
	|	СпрНоменклатура.Родитель.Родитель КАК Группа
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыТоваровSKU КАК КодыТоваровSKU
	|		ПО СпрНоменклатура.Родитель = КодыТоваровSKU.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыТоваровSKU КАК КодыТоваровSKUГруппы
	|		ПО СпрНоменклатура.Родитель.Родитель = КодыТоваровSKUГруппы.Номенклатура
	|ГДЕ
	|	СпрНоменклатура.Ссылка В(&МассивНоменклатур)
	|	И НЕ СпрНоменклатура.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	СпрНоменклатура.Родитель,
	|	КодыТоваровSKUГруппы.SKU,
	|	СпрНоменклатура.Родитель.Родитель";
	
	Запрос.УстановитьПараметр("МассивНоменклатур", МассивНоменклатур);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Номенклатура   = Выборка.Номенклатура;
			НоваяСтрока.SKU            = Выборка.SKU;
			НоваяСтрока.Группа         = Выборка.Группа;
			НоваяСтрока.ЭтоГруппа      = Истина;
			//НоваяСтрока.Весовой        = Ложь;
			НоваяСтрока.Цена           = 0;
		КонецЦикла;
		
		МассивНоменклатур = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Номенклатура");
		
		ДобавитьГруппыНоменклатуры(Товары, МассивНоменклатур);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
